src/Catalogs/кфкКаналыСпецификации/кфкКаналыСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кфкКаналыСпецификации</name>
  <owners>Catalog.кфкСпецификации</owners>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.кфкПриложенияСпецификаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДанных</name>
    <type>
      <types>CatalogRef.кфкТипыДанныхСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресТопика</name>
    <comment>channels.{ИмяКанала}.address: {АдресТопика}</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКанала</name>
    <comment>channels.{ИмяКанала}</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОперации</name>
    <comment>operations.{ИмяОперации}</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСообщения</name>
    <comment>components.messages.{ИмяСообщения}</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСообщенияКанала</name>
    <comment>channels.{ИмяКанала}.messages.{ИмяСообщенияКанала}</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.кфкПриложенияСпецификаций</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/кфкИзмененияОбъектовСпецификаций/кфкИзмененияОбъектовСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>кфкИзмененияОбъектовСпецификаций</name>
  <resources>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидИзменений</name>
    <type>
      <types>EnumRef.кфкВидыИзмененияДанных</types>
    </type>
  </resources>
  <resources>
    <name>ВидПовышения</name>
    <type>
      <types>EnumRef.кфкВидыПовышенияВерсий</types>
    </type>
  </resources>
  <attributes>
    <name>БазоваяВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.кфкСпецификации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.кфкКомпонентСпецификации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/кфкВидыПовышенияВерсий/кфкВидыПовышенияВерсий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>кфкВидыПовышенияВерсий</name>
  <enumValues>
    <name>ОсновнаяВерсия</name>
  </enumValues>
  <enumValues>
    <name>ДополняющаяВерсия</name>
  </enumValues>
  <enumValues>
    <name>ВерсияИсправления</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/кфкКаналыСпецификации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПослеЗаписиВерсийИсторииДанных(ИнформацияОЗаписиВерсий)
	
	РегистрыСведений.кфкИзмененияОбъектовСпецификаций.ОбработкаЗаписиВерсийИсторииДанных(ИнформацияОЗаписиВерсий);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьВидПовышения(Данные, История, ЭтоНовый) Экспорт
	
	ВидыПовышения = Перечисления.кфкВидыПовышенияВерсий;
	ИндексыПовышения = ВидыПовышения.Индексы();
	Результат = 9;
	
	Если ТипЗнч(История) = Тип("ИнформацияОЗаписиВерсииИсторииДанных") Тогда // Новый объект или удаление старого объекта
		Если ЭтоНовый Тогда
			Если История.ВидИзмененияДанных = ВидИзмененияДанных.Добавление Тогда
				ВидПовышения = ВидыПовышения.ДополняющаяВерсия;
				
			ИначеЕсли История.ВидИзмененияДанных = ВидИзмененияДанных.Изменение Тогда
				ВидПовышения = ?(
					ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(История.ДанныеВерсии, "ПометкаУдаления", Ложь),
					ВидыПовышения.ПустаяСсылка(), ВидыПовышения.ДополняющаяВерсия);
				
			Иначе
				ВидПовышения = ВидыПовышения.ПустаяСсылка();
				
			КонецЕсли;
			
		ИначеЕсли История.ВидИзмененияДанных = ВидИзмененияДанных.Удаление Тогда
			ВидПовышения = ВидыПовышения.ОсновнаяВерсия;
			
		Иначе
			ВызватьИсключение НСтр("ru = 'Недопустимый сценарий изменения!'");
			
		КонецЕсли;
		Результат = ИндексыПовышения.Найти(ВидПовышения);
		
	Иначе
		Для Каждого КлючЗначение Из История Цикл
			ИмяРеквизита = КлючЗначение.Ключ;
			Изменения = КлючЗначение.Значение;
			
			Если ИмяРеквизита = "Владелец" Тогда
				ВызватьИсключение НСтр("ru = 'Нельзя изменять спецификацию!'");
				
			ИначеЕсли ИмяРеквизита = "ПометкаУдаления" Тогда
				ВидПовышения = ?(Изменения.ЗначениеПослеИзменения,
					ВидыПовышения.ОсновнаяВерсия, ВидыПовышения.ДополняющаяВерсия);
				Результат = ИндексыПовышения.Найти(ВидПовышения);
				Прервать; // Признак удаления имеет приоритет
				
			ИначеЕсли ИмяРеквизита = "ТипДанных" Тогда
				ВидПовышения = ВидыПовышения.ОсновнаяВерсия;
				
			ИначеЕсли ИмяРеквизита = "Получатели" Или ИмяРеквизита = "АдресТопика" Тогда
				ВидПовышения = ВидыПовышения.ДополняющаяВерсия;
				
			ИначеЕсли ИмяРеквизита = "Наименование" Или ИмяРеквизита = "Отправитель"
					Или ИмяРеквизита = "ИмяКанала" Или ИмяРеквизита = "ИмяОперации"
					Или ИмяРеквизита = "ИмяСообщения" Или ИмяРеквизита = "ИмяСообщенияКанала" Тогда
				ВидПовышения = ВидыПовышения.ВерсияИсправления;
				
			Иначе
				ВызватьИсключение СтрШаблон(НСтр("ru = 'Неизвестное имя реквизита: %1'"), ИмяРеквизита);
			КонецЕсли;
			
			Результат = Мин(Результат, ИндексыПовышения.Найти(ВидПовышения));
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат ?(Результат = 9, -1, Результат);
	
КонецФункции

#КонецОбласти

#КонецЕсли
